AtomiJD/jdBasic/esp32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 16 MB on the DevKitC-1 N16R8. The app alone is well past the 1 MB a
# default partition table gives, hence partitions.csv.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# The console goes out UART0, which on a DevKitC-1 is the socket with
# the CH343 bridge. That path has a real reset circuit, flashes without
# the watchdog dance, and stays up when a fault takes the native USB
# device down. sdkconfig.usbconsole moves it to the native port.

CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# TRY/CATCH and std::bad_alloc are load-bearing in the interpreter.
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# jdBasic parses and interprets recursively. The main task is where the
# REPL runs, so it gets the stack the RP2350 build carves out in its
# linker script.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=98304

# Compiling a program blocks the core for longer than the watchdog's
# patience, and there is no other task waiting on it.
CONFIG_ESP_TASK_WDT_INIT=n

# A failed allocation must reach the interpreter as std::bad_alloc.
CONFIG_HEAP_ABORT_WHEN_ALLOCATION_FAILS=n


# Octal PSRAM needs this. At the IDF default of 160 MHz the first real
# access to PSRAM stalls the bus on this silicon and the boot never
# returns from esp_psram_extram_test(); at 240 MHz Espressif's own PSRAM
# test app passes on the same board. Costs nothing when PSRAM is out,
# and a faster interpreter is no loss either.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# The flash store: FATFS on a wear-levelled partition. Long names,
# because 8.3 would rename half the examples.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=128
